
## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 5 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
* Replace
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (10 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                     = "CaTH-Group"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/ae62c13b-54aa-4bf2-a500-674862b42f2e" -> (known after apply)
      ~ job_schedule_id         = "ae62c13b-54aa-4bf2-a500-674862b42f2e" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "target_application_secret" = (sensitive value)
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects_trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects_trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/c02297ca-0cd0-4831-8723-ac77893ee3c3" -> (known after apply)
      ~ job_schedule_id         = "c02297ca-0cd0-4831-8723-ac77893ee3c3" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "target_application_secret" = (sensitive value)
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-05-01T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-04-30T11:49:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights_java.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "pip-ss-stg-java-appinsights" -> "96659351-7db0-4d86-8459-e7510ec56617"
        id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-java-appinsights"
        name                                  = "pip-ss-stg-java-appinsights"
        tags                                  = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (15 unchanged attributes hidden)
    }

  # module.application_insights_nodejs.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "pip-ss-stg-nodejs-appinsights" -> "bec95b39-155e-4b24-991a-62ab1f7caa0e"
        id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-nodejs-appinsights"
        name                                  = "pip-ss-stg-nodejs-appinsights"
        tags                                  = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":169,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->